# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [2]:
# 記得先 Import 正確的套件
import numpy as np
import pandas as pd

In [3]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [4]:
print ('2nd way \n',df.groupby('animal').age.mean(),'\n')

2nd way
 animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

In [5]:
# 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
sort_age=df.sort_values(by=["age"], ascending=True, axis=0)
print(sort_age)
sort_visits=sort_age.sort_values(by=["visits"], ascending=False, axis=0)
sort_visits

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

  animal  age  visits priority
f    cat  2.0       3       no
b    cat  3.0       3      yes
d    dog  NaN       3      yes
c  snake  0.5       2       no
e    dog  5.0       2       no
i    dog  7.0       2       no
a    cat  2.5       1      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
h    cat  NaN       1      yes

In [6]:
#- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
sort_visits=sort_visits.replace(["yes","no"],[True,False])
sort_visits

  animal  age  visits  priority
f    cat  2.0       3     False
b    cat  3.0       3      True
d    dog  NaN       3      True
c  snake  0.5       2     False
e    dog  5.0       2     False
i    dog  7.0       2     False
a    cat  2.5       1      True
j    dog  3.0       1     False
g  snake  4.5       1     False
h    cat  NaN       1      True

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [10]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.880257  0.761873  0.269363
1  0.368071  0.811882  0.952549
2  0.427849  0.767571  0.579209
3  0.870466  0.061159  0.139940
4  0.393777  0.031345  0.558884

In [11]:
# 將每個數字減去該欄位的平均
df.mean(axis=0)
print(df.mean(axis=0))
Q1=df-df.mean(axis=0)
print(Q1)

0    0.588084
1    0.486766
2    0.499989
dtype: float64
          0         1         2
0  0.292173  0.275107 -0.230626
1 -0.220013  0.325116  0.452560
2 -0.160235  0.280805  0.079220
3  0.282382 -0.425607 -0.360049
4 -0.194307 -0.455421  0.058895

In [12]:
#將每個數字減去該筆資料的平均數
df.mean(axis=1)
Q2=df.sub(df.mean(axis=1),axis=0)
print(Q2)

          0         1         2
0  0.243093  0.124709 -0.367802
1 -0.342763  0.101048  0.241715
2 -0.163694  0.176028 -0.012334
3  0.513278 -0.296029 -0.217248
4  0.065775 -0.296657  0.230882

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [13]:
df

          0         1         2
0  0.880257  0.761873  0.269363
1  0.368071  0.811882  0.952549
2  0.427849  0.767571  0.579209
3  0.870466  0.061159  0.139940
4  0.393777  0.031345  0.558884

In [14]:
#1) 哪一比的資料總合最小
df.sum(axis=1)
print(df.sum(axis=1))
print("minimum data row is : ",df.sum(axis=1).idxmin())

0    1.911492
1    2.132501
2    1.774629
3    1.071564
4    0.984006
dtype: float64
minimum data row is :  4

In [15]:
#2) 哪一欄位的資料總合最小
df.sum(axis=0)
print(df.sum(axis=0))
print("the minimum column is : ", df.sum(axis=0).idxmin())

0    2.940420
1    2.433829
2    2.499943
dtype: float64
the minimum column is :  1